{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "border_mode": "valid", "nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf", "batch_input_shape": [null, 64, 64, 3], "W_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 128, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 123008, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 128, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "name": "dense_2"}}]}